random_seed: 114514

dataset:
  type: "nuscenes"
  root: "/data/nuscenes" # absolute path to the dataset root
  train_path: "trainval"
  val_path: "test"
  test_path: "test"
  batch_size: 16
  workers: 1
  random_flip: 0.5
  random_crop: 0.5
  scale: 0.4
  shift: 0.1
  epoch: 100
  name: 
    - animal
    - human.pedestrian.adult
    - human.pedestrian.child
    - human.pedestrian.construction_worker
    - human.pedestrian.personal_mobility
    - human.pedestrian.police_officer
    - human.pedestrian.stroller
    - human.pedestrian.wheelchair
    - movable_object.barrier
    - movable_object.debris
    - movable_object.pushable_pullable
    - movable_object.trafficcone
    - static_object.bicycle_rack
    - vehicle.bicycle
    - vehicle.bus.bendy
    - vehicle.bus.rigid
    - vehicle.car
    - vehicle.construction
    - vehicle.emergency.ambulance
    - vehicle.emergency.police
    - vehicle.motorcycle
    - vehicle.trailer
    - vehicle.truck

model:
  type: "monolite_YOLO11_centernet"
  backbone:
    # YOLO11n backbone
    # [from, repeats, module, args]
    - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
    - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
    - [-1, 2, C3k2, [256, False, 0.25]]
    - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
    - [-1, 2, C3k2, [512, False, 0.25]]
    - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
    - [-1, 2, C3k2, [512, True]]
    - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
    - [-1, 2, C3k2, [1024, True]]
    - [-1, 1, SPPF, [1024, 5]] # 9
    - [-1, 2, C2PSA, [1024]] # 10
    # YOLO11n head
  head:
    - [-1, 1, Linear, [512]] # 11
    - [-1, 1, Linear, [128]] # 12

optimizer:
  type: 'sgd'
  lr: 0.00125
  weight_decay: 0.00001 # SGD